html/rust/module.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>模块</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="pattern_match.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">模块</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5a90723">包和 crate</a>
<ul>
<li><a href="#org271aae0">root</a></li>
<li><a href="#orgfef4785">作用</a></li>
</ul>
</li>
<li><a href="#orgdd530c1">模块</a>
<ul>
<li><a href="#org4ae658e">模块树</a></li>
</ul>
</li>
<li><a href="#org4891d66">路径</a></li>
</ul>
</div>
</div>
<p>
当编写大型程序时，组织代码显得尤为重要，因为想在脑海中通晓整个程序，那几乎是不可能完成的。通过对 <span class="underline">相关功能</span> 进行 <span class="underline">分组</span> 和 <span class="underline">划分</span> 不同功能的代码，可以清楚 <b>在哪里可以找到实现了特定功能的代码</b> ，以及在 <b>哪里可以改变一个功能</b> 的工作方式
</p>

<pre class="example">
  到目前为止，我们编写的程序都在一个文件的一个模块中

  伴随着项目的增长，可以通过将代码分解为多个模块和多个文件来组织代码：
      一个包可以包含多个二进制 crate 项和一个可选的 crate 库
      伴随着包的增长，还可以将包中的部分代码提取出来，做成独立的 crate，这些 crate 则作为外部依赖项
</pre>
<p>
除了对功能进行分组以外， <span class="underline">封装实现细节</span> 可以更高级地 <b>重用代码</b> ：实现了一个操作后，其他的代码可以通过该代码的公共接口来进行调用，而不需要知道它是如何实现的
</p>

<pre class="example">
  在编写代码时可以定义哪些部分是其他代码可以使用的公共部分，以及哪些部分是有权更改实现细节的私有部分

  这是另一种减少脑海中记住项目内容数量的方法
</pre>

<p>
这里有一个需要说明的概念 <span class="underline">作用域</span> ： <b>代码所在的嵌套上下文</b> 有一组定义为 <span class="underline">in scope</span>  的 <span class="underline">名称</span> 。当阅读、编写和编译代码时，程序员和编译器需要知道 <span class="underline">特定位置的特定名称</span> 是否引用了 <span class="underline">变量</span> 、 <span class="underline">函数</span> 、 <span class="underline">结构体</span> 、 <span class="underline">枚举</span> 、 <span class="underline">模块</span> 、 <span class="underline">常量</span> 或者 <span class="underline">其他有意义的项</span> 
</p>

<pre class="example">
  可以创建作用域，以及改变哪些名称在作用域内还是作用域外

  同一个作用域内不能拥有两个相同名称的项

  我们可以使用一些工具来解决名称冲突
</pre>

<p>
Rust 有许多功能可以让管理代码的组织，包括哪些内容可以被公开，哪些内容作为私有部分，以及程序每个作用域中的名字。这些功能。被称为 <span class="underline">模块系统</span> ，包括：
</p>
<ul class="org-ul">
<li><b>包</b> ： Cargo 的一个功能，它允许你 <span class="underline">构建</span> 、 <span class="underline">测试</span> 和 <span class="underline">分享</span>  crate</li>
<li><b>Crates</b> ：一个 <span class="underline">模块的树形结构</span> ，它形成了 <span class="underline">库</span> 或 <span class="underline">二进制项目</span></li>
<li><b>模块</b> 和 <b>use</b> ： 允许你控制 <span class="underline">作用域</span> 和 <span class="underline">路径</span> 的 <span class="underline">私有性</span></li>
<li><b>路径</b> ：一个命名例如 <span class="underline">结构体</span> 、 <span class="underline">函数</span> 或 <span class="underline">模块</span> 等项的方式</li>
</ul>

<pre class="example">
  本章将会涵盖所有这些概念，讨论它们如何交互，并说明如何使用它们来管理作用域

  到最后，会对模块系统有深入的了解，并且能够像专业人士一样使用作用域！

  对于一个由一系列相互关联的包组合而成的超大型项目，Cargo 还提供了 “工作空间” 这一功能，本章暂时不做讲解
</pre>
<div id="outline-container-org5a90723" class="outline-2">
<h2 id="org5a90723">包和 crate</h2>
<div class="outline-text-2" id="text-org5a90723">
<p>
<span class="underline">crate</span> 是一个 <b>二进制项</b> 或者 <b>库</b> ：
</p>
<ul class="org-ul">
<li>crate <span class="underline">root</span> 是一个 <b>源文件</b> ：Rust 编译器以它为起始点，并构成 crate 的 <span class="underline">根模块</span></li>
<li><span class="underline">包</span>  ：提供一系列功能的 <b>一个或者多个 crate</b> 
<ul class="org-ul">
<li>一个包会包含有一个 <span class="underline">Cargo.toml</span> 文件，阐述如何去 <b>构建这些 crate</b></li>
</ul></li>
</ul>

<p>
包中所包含的内容由几条规则来确立：
</p>
<ol class="org-ol">
<li>一个包中 <b>至多只能</b> 包含 <span class="underline">一个库 crate</span></li>
<li>包中可以包含 <b>任意</b> 多个 <span class="underline">二进制 crate</span></li>
<li>包中 <b>至少</b> 包含 <span class="underline">一个 crate</span> ，无论是库的还是二进制的</li>
</ol>

<p>
当输入命令 cargo new：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cargo new my-project
     Created binary (application) <span style="color: #fa8072;">`my-project`</span> package
$ ls my-project
Cargo.toml
src
$ ls my-project/src
main.rs
</pre>
</div>

<p>
Cargo 会给我们的包创建一个 <span class="underline">Cargo.toml</span> 文件 
</p>
</div>

<div id="outline-container-org271aae0" class="outline-3">
<h3 id="org271aae0">root</h3>
<div class="outline-text-3" id="text-org271aae0">
<pre class="example">
  查看 Cargo.toml 的内容，却会发现并没有提到 src/main.rs
</pre>

<p>
因为 Cargo 遵循的一个约定：
</p>
<ul class="org-ul">
<li><span class="underline">src/main.rs</span> : 就是一个与 <span class="underline">包同名</span> 的 <span class="underline">二进制 crate</span> 的 <span class="underline">crate 根</span></li>
<li>如果包目录中包含 <span class="underline">src/lib.rs</span> ，则包带有与其 <span class="underline">同名</span> 的 <span class="underline">库 crate</span> ，且 src/lib.rs 是 <span class="underline">crate 根</span></li>
<li>crate 根文件将由 Cargo 传递给 <span class="underline">rustc</span> 来实际构建库或者二进制项目</li>
</ul>

<pre class="example">
  至此，已经有了一个只包含 src/main.rs 的包，意味着它只含有一个名为 my-project 的二进制 crate

  如果一个包同时含有 src/main.rs 和 src/lib.rs，则它有两个 crate：一个库和一个二进制项，且名字都与包相同
</pre>

<p>
通过将文件放在 <span class="underline">src/bin</span> 目录下，一个包可以 <b>拥有多个二进制 crate</b> ：每个 src/bin 下的文件都会被编译成一个独立的二进制 crate
</p>
</div>
</div>
<div id="outline-container-orgfef4785" class="outline-3">
<h3 id="orgfef4785">作用</h3>
<div class="outline-text-3" id="text-orgfef4785">
<p>
一个 crate 会将一个作用域内的相关功能分组到一起，使得该功能可以很方便地在 <b>多个项目之间共享</b> 
</p>

<pre class="example">
举一个例子，曾经使用的 rand crate 提供了生成随机数的功能

通过将 rand crate 加入到我们项目的作用域中，就可以在自己的项目中使用该功能

rand crate 提供的所有功能都可以通过该 crate 的名字：rand 进行访问
</pre>

<p>
将一个 crate 的功能保持在其自身的作用域中，可以知晓一些特定的功能是在自己的 crate 中定义的还是在 rand crate 中定义的，这可以 <b>防止潜在的冲突</b> 
</p>

<pre class="example">
  例如，rand crate 提供了一个名为 Rng 的特性（trait），还可以在自己的 crate 中定义一个名为 Rng 的 struct

  因为一个 crate 的功能是在自身的作用域进行命名的，所以编译器会知道：
      Rng 这个名字指向的是我们自己定义的 struct Rng
      rand::Rng 这一方式指向的才是 rand crate 中的 Rng 特性
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd530c1" class="outline-2">
<h2 id="orgdd530c1">模块</h2>
<div class="outline-text-2" id="text-orgdd530c1">
<pre class="example">
  在餐饮业，餐馆中会有一些地方被称之为前台，还有另外一些地方被称之为后台
      前台：招待顾客的地方，在这里，店主可以为顾客安排座位，服务员接受顾客下单和付款，调酒师会制作饮品
      后台：由厨师工作的厨房，洗碗工的工作地点，以及经理做行政工作的地方组成
</pre>

<p>
可以将 <span class="underline">函数</span> <b>放置</b> 到 <span class="underline">嵌套的模块</span> 中，来使 crate 结构与实际的餐厅结构相同。通过执行 <span class="underline">cargo new &#x2013;lib restaurant</span> ，来创建一个新的名为 <span class="underline">restaurant 的库</span> 。然后将下面所罗列出来的代码放入 src/lib.rs 中，来定义一些模块和函数：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">mod</span> <span style="color: #ffd700;">front_of_house</span> {
    <span style="color: #00bfff; font-weight: bold;">mod</span> <span style="color: #ffd700;">hosting</span> {
        <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">add_to_waitlist</span>() {}

        <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">seat_at_table</span>() {}
    }

    <span style="color: #00bfff; font-weight: bold;">mod</span> <span style="color: #ffd700;">serving</span> {
        <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">take_order</span>() {}

        <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">server_order</span>() {}

        <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">take_payment</span>() {}
    }
}
</pre>
</div>

<p>
<b>定义一个模块</b> ，是以 <span class="underline">mod</span> 关键字为起始，然后指定 <span class="underline">模块的名字</span> （本例中叫做 front_of_house），并且用 <span class="underline">花括号</span> 包围模块的主体
</p>
<ul class="org-ul">
<li>在模块内，还可以 <b>定义</b> <span class="underline">其他的模块</span> ，就像本例中的 hosting 和 serving 模块</li>
<li>模块还可以 <b>保存</b> 一些定义的其他项，比如 <span class="underline">结构体</span> 、 <span class="underline">枚举</span> 、 <span class="underline">常量</span> 、 <span class="underline">特性</span> 、或者 <span class="underline">函数</span></li>
</ul>

<pre class="example">
  通过使用模块，可以将相关的定义分组到一起，并指出他们为什么相关

  程序员可以通过使用这段代码，更加容易地找到他们想要的定义，因为他们可以基于分组来对代码进行导航，而不需要阅读所有的定义

  程序员向这段代码中添加一个新的功能时，他们也会知道代码应该放置在何处，可以保持程序的组织性
</pre>

<ul class="org-ul">
<li>模块可以将一个 <span class="underline">crate</span> 中的 <b>代码分组</b> ，以提高 <span class="underline">可读性</span> 与 <span class="underline">重用性</span></li>
<li>模块还可以控制项的 <b>私有性</b> ：
<ul class="org-ul">
<li>public: 项是可以被 <span class="underline">外部代码使用的</span></li>
<li>private: 作为一个 <span class="underline">内部实现</span> 的内容，不能被外部代码使用</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org4ae658e" class="outline-3">
<h3 id="org4ae658e">模块树</h3>
<div class="outline-text-3" id="text-org4ae658e">
<p>
在前面提到了， <span class="underline">src/main.rs</span> 和 <span class="underline">src/lib.rs</span> 叫做 <span class="underline">crate 根</span> 。之所以这样叫它们的原因是：这两个文件的内容都是一个从名为 crate 的模块作为 <b>根的 crate 模块结构</b> ，称为 <span class="underline">模块树</span> ：
</p>

<div class="org-src-container">
<pre class="src src-sh">crate
 &#9492;&#9472;&#9472; front_of_house
     &#9500;&#9472;&#9472; hosting
     &#9474;   &#9500;&#9472;&#9472; add_to_waitlist
     &#9474;   &#9492;&#9472;&#9472; seat_at_table
     &#9492;&#9472;&#9472; serving
         &#9500;&#9472;&#9472; take_order
         &#9500;&#9472;&#9472; serve_order
         &#9492;&#9472;&#9472; take_payment
</pre>
</div>

<ul class="org-ul">
<li>这个树展示了一些模块是如何被嵌入到另一个模块的：例如，hosting 嵌套在 front_of_house 中</li>
<li>这个树还展示了一些模块是互为 <span class="underline">兄弟</span>  的，这意味着它们定义在同一模块中：hosting 和 serving 被一起定义在 front_of_house 中</li>
<li>如果一个模块 A 被包含在模块 B 中，将模块 A 称为模块 B 的  <span class="underline">子</span> ，模块 B 则是模块 A 的 <span class="underline">父</span> 
<ul class="org-ul">
<li>注意：整个模块树都植根于名为 <span class="underline">crate</span> 的 <b>隐式模块</b> 下</li>
</ul></li>
</ul>

<pre class="example">
  这个模块树可能会令你想起电脑上文件系统的目录树：这是一个非常恰当的比喻！

  就像文件系统的目录，可以使用模块来组织代码，并且，就像目录中的文件，需要一种方法来找到模块
</pre>
</div>
</div>
</div>
<div id="outline-container-org4891d66" class="outline-2">
<h2 id="org4891d66">路径</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
